# 第3章 分组

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('data/table.csv',index_col='ID')
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

## 一、SAC过程
### 1. 内涵
SAC指的是分组操作中的split-apply-combine过程

其中split指基于某一些规则，将数据拆成若干组，apply是指对每一组独立地使用函数，combine指将每一组的结果组合成某一类数据结构
### 2. apply过程
在该过程中，我们实际往往会遇到四类问题：
- 整合（Aggregation）——即分组计算统计量（如求均值、求每组元素个数）
- 变换（Transformation）——即分组对每个单元的数据进行操作（如元素标准化）
- 过滤（Filtration）——即按照某些规则筛选出一些组（如选出组内某一指标小于50的组）
- 综合问题——即前面提及的三种问题的混合

## 二、groupby函数
### 1. 分组函数的基本内容：
#### （a）根据某一列分组

In [2]:
grouped_single = df.groupby('School')

经过groupby后会生成一个**groupby对象**，该对象**本身不会返回任何东西**，只有当相应的方法被调用才会起作用

例如取出某一个组：

In [3]:
grouped_single.get_group('S_1').head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

#### （b）根据某几列分组

In [4]:
grouped_mul = df.groupby(['School','Class'])
grouped_mul.get_group(('S_2','C_4'))

     School Class Gender   Address  Height  Weight  Math Physics
ID
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

#### （c）组容量与组数

In [5]:
grouped_single.size()

School
S_1    15
S_2    20
dtype: int64

In [6]:
grouped_mul.size()

School  Class
S_1     C_1      5
        C_2      5
        C_3      5
S_2     C_1      5
        C_2      5
        C_3      5
        C_4      5
dtype: int64

In [7]:
grouped_single.ngroups

2

In [8]:
grouped_mul.ngroups

7

#### （d）组的遍历

In [9]:
for name,group in grouped_single:
    print(name)
    display(group.head())

S_1

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

S_2

     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A

#### （e）level参数和axis参数
level参数用于多级索引时指定用哪一级索引进行分组

In [10]:
df.set_index(['Gender','School']).groupby(level=1,axis=0).get_group('S_1').head()

              Class   Address  Height  Weight  Math Physics
Gender School
M      S_1      C_1  street_1     173      63  34.0      A+
F      S_1      C_1  street_2     192      73  32.5      B+
M      S_1      C_1  street_2     186      82  87.2      B+
F      S_1      C_1  street_2     167      81  80.4      B-
       S_1      C_1  street_4     159      64  84.8      B+

### 2. groupby对象的特点
#### （a）查看所有可调用的方法
由此可见，groupby对象可以使用相当多的函数，灵活程度很高

In [11]:
print([attr for attr in dir(grouped_single) if not attr.startswith('_')])

['Address', 'Class', 'Gender', 'Height', 'Math', 'Physics', 'School', 'Weight', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'ewm', 'expanding', 'ffill', 'fillna', 'filter', 'first', 'get_group', 'groups', 'head', 'hist', 'idxmax', 'idxmin', 'indices', 'last', 'mad', 'max', 'mean', 'median', 'min', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'pct_change', 'pipe', 'plot', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sample', 'sem', 'shift', 'size', 'skew', 'std', 'sum', 'tail', 'take', 'transform', 'tshift', 'value_counts', 'var']

#### （b）分组对象的head和first
对分组对象使用head函数，返回的是**每个组的前几行**，而不是数据集前几行

In [12]:
grouped_single.head(2)

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+

first显示的是**以分组为索引的每组的第一个分组信息**

In [13]:
grouped_single.first()

       Class Gender   Address  Height  Weight  Math Physics
School
S_1      C_1      M  street_1     173      63  34.0      A+
S_2      C_1      M  street_7     174      84  83.3       C

#### （c）分组依据
对于groupby函数而言，分组的依据是非常自由的，只要是**与数据框长度相同的列表即可**，同时支持**函数型分组**

In [14]:
df.groupby(np.random.choice(['a','b','c'],df.shape[0])).get_group('a').head()
#相当于将np.random.choice(['a','b','c'],df.shape[0])当做新的一列进行分组

     School Class Gender   Address  Height  Weight  Math Physics
ID
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1303    S_1   C_3      M  street_7     188      82  49.7       B

从原理上说，我们可以看到利用函数时，传入的对象就是索引，因此根据这一特性可以做一些复杂的操作

In [15]:
df[:5].groupby(lambda x:print(x)).head(0)

1101
1102
1103
1104
1105

Empty DataFrame
Columns: [School, Class, Gender, Address, Height, Weight, Math, Physics]
Index: []

例如，根据奇偶行分组
> 注：
> 1. 使用`df.index.get_loc(x)`获取索引x所在位置
> 2. `GroupBy.groups`返回keys为组名，values为该组包含组标签的字典（仅针对某一列分类，多列分类建议用循环）

In [21]:
df.groupby(lambda x:'奇数行' if not df.index.get_loc(x)%2==1 else '偶数行').groups

{'偶数行': [1102, 1104, 1201, 1203, 1205, 1302, 1304, 2101, 2103, 2105, 2202, 2204, 2301, 2303, 2305, 2402, 2404], '奇数行': [1101, 1103, 1105, 1202, 1204, 1301, 1303, 1305, 2102, 2104, 2201, 2203, 2205, 2302, 2304, 2401, 2403, 2405]}

如果是多层索引，那么lambda表达式中的输入就是**元组**，下面实现的功能为查看两所学校中男女生分别均分是否及格
> 注意：此处只是演示groupby的用法，实际操作不会这样写

In [22]:
math_score = df.set_index(['Gender','School'])['Math'].sort_index()
grouped_score = df.set_index(['Gender','School']).sort_index().\
            groupby(lambda x:(x,'均分及格' if math_score[x].mean()>=60 else '均分不及格'))
for name,_ in grouped_score:print(name)

(('F', 'S_1'), '均分及格')
(('F', 'S_2'), '均分及格')
(('M', 'S_1'), '均分及格')
(('M', 'S_2'), '均分不及格')

#### （d）groupby的[]操作
可以用[]选出groupby对象的某个或者某几个列，上面的均分比较可以如下简洁地写出：

In [19]:
df.groupby(['Gender','School'])['Math'].mean()>=60

Gender  School
F       S_1        True
        S_2        True
M       S_1        True
        S_2       False
Name: Math, dtype: bool

用列表可选出多个属性列：

In [20]:
df.groupby(['Gender','School'])[['Math','Height']].mean()

                    Math      Height
Gender School
F      S_1     64.100000  173.125000
       S_2     66.427273  173.727273
M      S_1     63.342857  178.714286
       S_2     51.155556  172.000000

#### （e）连续型变量分组
例如利用cut函数对数学成绩分组：

In [23]:
bins = [0,40,60,80,90,100]
cuts = pd.cut(df['Math'],bins=bins) #可选label添加自定义标签
df.groupby(cuts)['Math'].count()

Math
(0, 40]       7
(40, 60]     10
(60, 80]      9
(80, 90]      7
(90, 100]     2
Name: Math, dtype: int64

## 三、聚合、过滤和变换
### 1. 聚合（Aggregation）
#### （a）常用聚合函数
所谓聚合就是**把一堆数，变成一个标量**，因此mean/sum/size/count/std/var/sem/describe/first/last/nth/min/max都是聚合函数

为了熟悉操作，不妨验证标准误sem函数，它的计算公式是：$\frac{组内标准差}{\sqrt{组容量}}$，下面进行验证：

In [26]:
group_m = grouped_single['Math']
# group_m.std()
group_m.head()

NameError: name 'grouped_single' is not defined

In [52]:
group_m.std().values/np.sqrt(group_m.count().values) == group_m.sem().values # 最后的结果是每一组的比较结果

array([ True,  True])

#### （b）同时使用多个聚合函数
利用**列表**对所有列使用多个聚合函数

In [56]:
group_m.agg(['sum','mean','std'])

           sum       mean        std
School
S_1      956.2  63.746667  23.077474
S_2     1191.1  59.555000  17.589305

利用**元组**进行某一列多个聚合函数重命名，元组第一位是新名字，第二位是对应函数与列名

In [57]:
group_m.agg([('rename_sum','sum'),('rename_mean','mean')])

        rename_sum  rename_mean
School
S_1          956.2    63.746667
S_2         1191.1    59.555000

利用**字典**指定哪些函数作用哪些列

In [58]:
grouped_mul.agg({'Math':['mean','max'],'Height':'var'})

               Math       Height
               mean   max    var
School Class
S_1    C_1    63.78  87.2  183.3
       C_2    64.30  97.0  132.8
       C_3    63.16  87.7  179.2
S_2    C_1    58.56  83.3   54.7
       C_2    62.80  85.4  256.0
       C_3    63.06  95.5  205.7
       C_4    53.80  67.7  300.2

#### （c）使用自定义函数
可以发现，agg函数的传入是**分组逐列**进行的，有了这个特性就可以做许多事情

In [33]:
grouped_single[['Math','Height']].agg(lambda x:print(x.head(),'换行\n'))

ID
1101    34.0
1102    32.5
1103    87.2
1104    80.4
1105    84.8
Name: Math, dtype: float64 换行

ID
2101    83.3
2102    50.6
2103    52.5
2104    72.2
2105    34.2
Name: Math, dtype: float64 换行

ID
1101    173
1102    192
1103    186
1104    167
1105    159
Name: Height, dtype: int64 换行

ID
2101    174
2102    161
2103    157
2104    159
2105    170
Name: Height, dtype: int64 换行

        Math Height
School
S_1     None   None
S_2     None   None

官方没有提供极差计算的函数，但通过agg可以容易地实现组内极差计算

In [34]:
grouped_single['Math'].agg(lambda x:x.max()-x.min())

School
S_1    65.5
S_2    62.8
Name: Math, dtype: float64

#### （d）利用NamedAgg函数进行多个聚合
 注意：不支持lambda函数，但是可以使用外置的def函数

In [50]:
def R1(x):
    return x.max()-x.min()
grouped_single.agg(min_score1=pd.NamedAgg(column='Math', aggfunc='min'),
                           max_score1=pd.NamedAgg(column='Math', aggfunc='max'),
                           range_score2=pd.NamedAgg(column='Math', aggfunc=R1)).head()

        min_score1  max_score1  range_score2
School
S_1           31.5        97.0          65.5
S_2           32.7        95.5          62.8

关于聚合函数结果的重命名：

使用多个字典的嵌套可以对多个列的多个聚合函数进行重命名，例如`{'Math':{'rename_mean':'mean','rename_max':'max'},'Height':{'rename_var':'var'}}`。但是这种重命名方式写出的代码包含了多重索引，并不优雅。

使用`pd.NameAgg`（本章节）或者下面的方式（推荐）更好。
> 参考文章：[Why is Nobody Talking about Pandas NamedAgg?](https://deanla.com/pandas_named_agg.html)

In [62]:
def R1(x):
    return x.max()-x.min()
grouped_mul.agg(min_score1=('Math', 'min'),
               max_score1=('Math', 'max'),
               range_score2=('Math', R1)).head()

              min_score1  max_score1  range_score2
School Class
S_1    C_1          32.5        87.2          54.7
       C_2          33.8        97.0          63.2
       C_3          31.5        87.7          56.2
S_2    C_1          34.2        83.3          49.1
       C_2          39.1        85.4          46.3

#### （e）带参数的聚合函数
判断是否组内数学分数至少有一个值在50-52之间：

In [63]:
def f(s,low,high):
    return s.between(low,high).max()
grouped_single['Math'].agg(f,50,52)

School
S_1    False
S_2     True
Name: Math, dtype: bool

如果需要使用多个函数，并且其中至少有一个带参数，则使用wrap技巧：
> 这里用到了装饰器的内容

In [64]:
def f_test(s,low,high):
    return s.between(low,high).max()
def agg_f(f_mul,name,*args,**kwargs):
    def wrapper(x):
        return f_mul(x,*args,**kwargs)
    wrapper.__name__ = name
    return wrapper
new_f = agg_f(f_test,'at_least_one_in_50_52',50,52)
grouped_single['Math'].agg([new_f,'mean']).head()

        at_least_one_in_50_52       mean
School
S_1                     False  63.746667
S_2                      True  59.555000

### 2. 过滤（Filteration）
filter函数是用来**筛选某些组**的（务必记住结果是**组的全体**），因此传入的值应当是**布尔标量**

In [78]:
grouped_single[['Math','Physics']].filter(lambda x:(x['Math']>32).all()).head()

      Math Physics
ID
2101  83.3       C
2102  50.6      B+
2103  52.5      B-
2104  72.2      B+
2105  34.2       A

### 3. 变换（Transformation）
#### （a）传入对象
transform函数中传入的对象是组内的列，并且**返回值需要与列长完全一致**

In [79]:
grouped_single[['Math','Height']].transform(lambda x:x-x.min()).head()

      Math  Height
ID
1101   2.5      14
1102   1.0      33
1103  55.7      27
1104  48.9       8
1105  53.3       0

如果返回了标量值，那么**组内的所有元素会被广播为这个值**

In [80]:
grouped_single[['Math','Height']].transform(lambda x:x.mean()).head()

           Math      Height
ID
1101  63.746667  175.733333
1102  63.746667  175.733333
1103  63.746667  175.733333
1104  63.746667  175.733333
1105  63.746667  175.733333

#### （b）利用变换方法进行组内标准化

In [81]:
grouped_single[['Math','Height']].transform(lambda x:(x-x.mean())/x.std()).head()

          Math    Height
ID
1101 -1.288991 -0.214991
1102 -1.353990  1.279460
1103  1.016287  0.807528
1104  0.721627 -0.686923
1105  0.912289 -1.316166

#### （c）利用变换方法进行组内缺失值的均值填充

In [85]:
df_nan = df[['Math','School']].copy().reset_index()
df_nan.loc[np.random.randint(low=0,high=df.shape[0],size=25),['Math']]=np.nan
df_nan.head()

     ID  Math School
0  1101   NaN    S_1
1  1102  32.5    S_1
2  1103   NaN    S_1
3  1104   NaN    S_1
4  1105  84.8    S_1

In [86]:
df_nan.groupby('School').transform(lambda x: x.fillna(x.mean())).join(df.reset_index()['School']).head()

     ID   Math School
0  1101  54.68    S_1
1  1102  32.50    S_1
2  1103  54.68    S_1
3  1104  54.68    S_1
4  1105  84.80    S_1

## 四、apply函数

### 1. apply函数的灵活性
可能在所有的分组函数中，apply是应用最为广泛的，这得益于它的灵活性。

对于传入值而言，从下面的打印内容可以看到是以分组的表传入apply中：

In [87]:
df.groupby('School').apply(lambda x:print(x.head(1)))

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C

Empty DataFrame
Columns: []
Index: []

apply函数的灵活性很大程度来源于其返回值的多样性：
#### ① 标量返回值

In [88]:
df[['School','Math','Height']].groupby('School').apply(lambda x:x.max())

       School  Math  Height
School
S_1       S_1  97.0     195
S_2       S_2  95.5     194

#### ② 列表返回值

In [89]:
df[['School','Math','Height']].groupby('School').apply(lambda x:x-x.min()).head()

      Math  Height
ID
1101   2.5    14.0
1102   1.0    33.0
1103  55.7    27.0
1104  48.9     8.0
1105  53.3     0.0

#### ③ 数据框返回值

In [90]:
df[['School','Math','Height']].groupby('School')\
    .apply(lambda x:pd.DataFrame({'col1':x['Math']-x['Math'].max(),
                                  'col2':x['Math']-x['Math'].min(),
                                  'col3':x['Height']-x['Height'].max(),
                                  'col4':x['Height']-x['Height'].min()})).head()

      col1  col2  col3  col4
ID
1101 -63.0   2.5   -22    14
1102 -64.5   1.0    -3    33
1103  -9.8  55.7    -9    27
1104 -16.6  48.9   -28     8
1105 -12.2  53.3   -36     0

### 2. 用apply同时统计多个指标
此处可以借助OrderedDict工具进行快捷的统计：

In [93]:
from collections import OrderedDict
def f(df):
    data = OrderedDict() # 生成记住插入顺序的字典
    data['M_sum'] = df['Math'].sum()
    data['W_var'] = df['Weight'].var()
    data['H_mean'] = df['Height'].mean()
#     print(data)
    return pd.Series(data)
grouped_single.apply(f)

         M_sum       W_var      H_mean
School
S_1      956.2  117.428571  175.733333
S_2     1191.1  181.081579  172.950000

## 五、问题与练习

### 1. 问题

#### 【问题一】 什么是fillna的前向/后向填充，如何实现？
A: 在df.fillna中mathod参数中指定，bfill是向后填充，表示默认最后一个值作为填充值；ffill是向前填充，表示默认第一个值作为填充值。

#### 【问题二】 下面的代码实现了什么功能？请仿照设计一个它的groupby版本。

In [2]:
s = pd.Series ([0, 1, 1, 0, 1, 1, 1, 0])
s1 = s.cumsum()
result = s.mul(s1).diff().where(lambda x: x < 0).ffill().add(s1,fill_value=0)
result

0    0.0
1    1.0
2    2.0
3    0.0
4    1.0
5    2.0
6    3.0
7    0.0
dtype: float64

#### 【问题三】 如何计算组内0.25分位数与0.75分位数？要求显示在同一张表上。
A：用warp技巧。

#### 【问题四】 既然索引已经能够选出某些符合条件的子集，那么filter函数的设计有什么意义？
A：索引是针对指定行或者指定列的，而filter是筛选出指定组的，侧重点不一样，有时filter方法会更简便。

#### 【问题五】 整合、变换、过滤三者在输入输出和功能上有何异同？
A：

#### 【问题六】 在带参数的多函数聚合时，有办法能够绕过wrap技巧实现同样功能吗？
A：

### 2. 练习
#### 【练习一】： 现有一份关于diamonds的数据集，列分别记录了克拉数、颜色、开采深度、价格，请解决下列问题：

In [3]:
df = pd.read_csv('data/Diamonds.csv')
df.head()

   carat color  depth  price
0   0.23     E   61.5    326
1   0.21     E   59.8    326
2   0.23     E   56.9    327
3   0.29     I   62.4    334
4   0.31     J   63.3    335

#### (a) 在所有重量超过1克拉的钻石中，价格的极差是多少？

In [4]:
df[df['carat']>1]['price'].agg(lambda x:x.max()-x.min())

17561

#### (b) 若以开采深度的0.2\0.4\0.6\0.8分位数为分组依据，每一组中钻石颜色最多的是哪一种？该种颜色是组内平均而言单位重量最贵的吗？

In [5]:
bins = [df['depth'].min()-0.1] + [df['depth'].quantile(q=i) for i in [0.2,0.4,0.6,0.8]] + [df['depth'].max()]
cuts = pd.cut(df['depth'],bins=bins)
df.groupby(cuts)['color'].apply(lambda x:x.value_counts().idxmax())

depth
(42.9, 60.8]    E
(60.8, 61.6]    G
(61.6, 62.1]    G
(62.1, 62.7]    G
(62.7, 79.0]    G
Name: color, dtype: object

In [72]:
df.groupby([cuts,'color']).agg(carat_sum=('carat',sum)).reset_index().groupby('carat')['carat_sum'].agg(max) # 我是真的不会了...

carat
(0.0, 0.5]     1517.11
(0.5, 1.0]     2569.42
(1.0, 1.5]     3194.75
(1.5, 2.0]     1252.11
(2.0, 5.01]    1203.26
Name: carat_sum, dtype: float64

#### (c) 以重量分组(0-0.5,0.5-1,1-1.5,1.5-2,2+)，按递增的深度为索引排序，求每组中连续的严格递增价格序列长度的最大值。

In [55]:
bins = [0,0.5,1,1.5,2,df['carat'].max()]
cuts = pd.cut(df['carat'],bins=bins)
df.groupby(cuts).agg(max).sort_values(by='depth')[['price']]

             price
carat
(1.5, 2.0]   18818
(2.0, 5.01]  18823
(0.5, 1.0]   16469
(1.0, 1.5]   18700
(0.0, 0.5]    3378

#### (d) 请按颜色分组，分别计算价格关于克拉数的回归系数。（单变量的简单线性回归，并只使用Pandas和Numpy完成）

In [78]:
df.groupby('color').apply(lambda x:(x['carat']-x['carat'].mean())*(x['price']-x['price'].mean())/(x['carat']-x['carat'].mean())**2)

color
D      28       6575.474673
       34       6470.284062
       38       6955.731598
       42       6955.731598
       43       6955.731598
                   ...
J      53702    9944.496522
       53787    9898.718889
       53848    7549.080898
       53852    7773.358423
       53917    9807.163624
Length: 53940, dtype: float64

#### 【练习二】：有一份关于美国10年至17年的非法药物数据集，列分别记录了年份、州（5个）、县、药物类型、报告数量，请解决下列问题：

In [43]:
pd.read_csv('data/Drugs.csv').head()

   YYYY State           COUNTY  SubstanceName  DrugReports
0  2010    VA         ACCOMACK   Propoxyphene            1
1  2010    OH            ADAMS       Morphine            9
2  2010    PA            ADAMS      Methadone            2
3  2010    VA  ALEXANDRIA CITY         Heroin            5
4  2010    PA        ALLEGHENY  Hydromorphone            5

#### (a) 按照年份统计，哪个县的报告数量最多？这个县所属的州在当年也是报告数最多的吗？

#### (b) 从14年到15年，Heroin的数量增加最多的是哪一个州？它在这个州是所有药物中增幅最大的吗？若不是，请找出符合该条件的药物。